# Family Symbol Set Structural Section Method

Source: https://www.revitapidocs.com/2026/c3348673-0c95-eaf6-9d89-8cd8c81b48f6.htm

---

| Family Symbol Set Structural Section Method |
| --- |

Sets the structural section in element.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetStructuralSection(
	StructuralSection structuralSection
)
```

```
Public Sub SetStructuralSection (
	structuralSection As StructuralSection
)
```

```
public:
void SetStructuralSection(
	StructuralSection^ structuralSection
)
```

```
member SetStructuralSection :
        structuralSection : StructuralSection -> unit
```

#### Parameters

structuralSection StructuralSection
:   Structural section with values that will be set.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | This FamilySymbol cannot have a structural section. |

Remarks Only beams, braces and structural columns can have a structural section.
 To check if the element can have structural section use the CanHaveStructuralSection method. See Also

#### Reference

FamilySymbol Class Autodesk.Revit.DB Namespace